tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/cask-fonts"

brew "mas"
brew "exiftool"
brew "ffmpeg"
brew "gh"
brew "ghostscript"
brew "gnupg"
brew "graphviz"
brew "imagemagick"
brew "node"
brew "optipng"
brew "pandoc"
brew "ruby"
brew "tinyxml2"
brew "wget"
brew "vim"
brew "git"
brew "tmux"
brew "telnet"
brew "binutils"
brew "automake"
brew "capstone"
brew "john-jumbo"
brew "zsh-completions"
brew "ripgrep"
brew "awscli"
brew "docker"
brew "pyenv"
brew "pipx"
brew "youtube-dl"
brew "bazel"
brew "teleport"
brew "apparency"
brew "qlcolorcode"
brew "qlmarkdown"
brew "quicklook-json"
brew "suspicious-package"
brew "pdf2svg"

cask "typora"
cask "eloston-chromium"
cask "adoptopenjdk"
cask "kindle"
cask "obs"
cask "rectangle"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"
cask "burp-suite"
cask "xquartz"
cask "font-sf-mono"
cask "docker"
cask "zoom"
cask "deepl"
cask "google-chrome"
# cask "clion"
# cask "pycharm"
cask "jetbrains-toolbox"
cask "balenaetcher"
cask "mathpix-snipping-tool"
cask "karabiner-elements"
cask "tor-browser"
cask "anki"
cask "atok"
cask "google-cloud-sdk"
cask "discord"
cask "tikzit"
cask "hiddenbar"
cask "freedom"
cask "deeper"
# cask "bitwarden" since touchID auth in browser is only available from App Store version 

mas "LINE", id: 539883307
mas "Slack", id: 803453959
mas "Xcode", id: 497799835 
mas "Mountain Duck", id: 1024974133
mas "GoodNotes 5", id: 1444383602
mas "Microsoft Word", id: 462054704
mas "Silicon Info", id: 1542271266
mas "Bitwarden", id: 1352778147
mas "Keynote", id: 409183694
# Mathematica, IDA Pro, Poetry 

cask "mactex" 
